{"pageContext":{"data":{"id":"930b5be4-7215-5b95-813e-9911009bc6fa","title":"WELCOME TO THE WHITLOCK ARCHITECTS BLOG","publishedAt":"2019-03-01T19:30:00.000Z","mainImage":{"asset":{"id":"476e337c-5e8b-5e4f-bb2c-a558f8d4656d","url":"https://cdn.sanity.io/images/mdtd9fbj/production/185af6281eec7571e3382384bbdc22fe4e651f97-912x513.png"}},"_createdAt":"2019-03-18T04:57:24Z","slug":{"current":"welcome-to-the-whitlock-architects-blog"},"body":[{"_key":"d133952643ea","_type":"block","children":[{"_key":"d133952643ea0","_type":"span","text":"At Whitlock Architects, we pride ourselves in understanding how restaurants function and how thoughtful design can assist in making your restaurant a success. We have a strong foundation in restaurant design built on decades of experience and from listening to each of our client’s individual needs."}],"asset":null,"style":"normal"},{"_key":"b43a3ecee480","_type":"block","children":[{"_key":"b43a3ecee4800","_type":"span","text":"The purpose of this blog is to provide owners, restaurateurs, chefs, and anyone interested in owning their own restaurant with some of the crucial knowledge we have learned. Whether it be new design trends; answers to common industry problems; information and reviews of new products, materials, and techniques; or interviews with notable professionals in the hospitality and restaurant design industries; we hope that you find this blog, and Whitlock Architects, to be a valuable resource when opening your restaurant."}],"asset":null,"style":"normal"},{"_key":"5a2d447d7d20","_type":"block","children":[{"_key":"5a2d447d7d200","_type":"span","text":"Our success requires great feedback, so please feel free to reach out to our team to let us know how we’re doing! If you would like to be featured in one of our blog posts, please direct all inquiries to "},{"_key":"5a2d447d7d201","_type":"span","text":"adewar@whitlockarchitects.com"},{"_key":"5a2d447d7d202","_type":"span","text":""}],"asset":null,"style":"normal"}],"author":null}}}