{"pageContext":{"data":{"id":"31a999a4-bf36-5499-8c0d-749318830ab4","title":"RESTAURANT DESIGN SERIES: RESTAURANTS AS JAZZ ENSEMBLES","publishedAt":"2019-03-03T18:30:00.000Z","mainImage":{"asset":{"id":"1e16a041-66eb-5bfa-93cf-65354a7c602f","url":"https://cdn.sanity.io/images/mdtd9fbj/production/baff8a74c152c80a4ea69159b9bcd2d77c0b53cb-1920x1200.jpg"}},"_createdAt":"2019-03-15T09:48:09Z","slug":{"current":"restaurant-design-series-restaurants-as-jazz-ensembles"},"body":[{"_key":"1b5f22d9495b","_type":"block","children":[{"_key":"1b5f22d9495b0","_type":"span","text":"In this series, we will discuss the broad topic of Restaurant Design. A restaurant is an extremely complicated entity that often has conflicting critical elements that must flow seamlessly together to be successful. The designer’s goal is to create a space where all of those diverse instruments collaborate together like a beautifully orchestrated jazz session."}],"asset":null,"style":"normal"},{"_key":"885afc7ca00f","_type":"block","children":[{"_key":"885afc7ca00f0","_type":"span","text":"Concept must come first"},{"_key":"885afc7ca00f1","_type":"span","text":". Before there is any successful restaurant there is a concept. A concept can be rock solid, born from years of vision, or it can evolve as the project grows. It can be driven by the menu, a location, a piece of art, a time period, or a sense of place. Sometimes it is very concrete and specific and sometimes it is vague and esoteric. In any case, a strong conceptual identity is imperative to creating a successful design. It informs every design decision and creates a consistent identity. Surprisingly, the most evocative ideas often come from sources unrelated to food, like a beautiful car or a great song. Distancing the ideas require greater abstract interpretation and can bring wonderful inspiration and imaginative ideas to the design."}],"asset":null,"style":"normal"},{"_key":"5c909884b233","_type":"block","children":[{"_key":"5c909884b2330","_type":"span","text":"Budgets are a reality"},{"_key":"5c909884b2331","_type":"span","text":". Budgets are often seen as the enemy of design, but are really just the context in which design is formed. Few projects have unlimited budgets (and certainly none of ours do!) and to stay within that budget and deliver a handsomely sophisticated space is where the true creativity of the design team shines through. One method of working within financial constraints is to perceive a restaurant design like a stage set. As designers we create a space and an atmosphere, but often through allusion and impression more than reality."}],"asset":null,"style":"normal"},{"_key":"f0a6a8ec146e","_type":"block","children":[{"_key":"f0a6a8ec146e0","_type":"span","text":"A restaurant is a business, and that business needs to work"},{"_key":"f0a6a8ec146e1","_type":"span","text":". No restaurant design is successful if it doesn’t allow its occupants to function efficiently. This has been highlighted on many painful reality television shows, (let us emphasize, "},{"_key":"f0a6a8ec146e2","_type":"span","text":"painful)"},{"_key":"f0a6a8ec146e3","_type":"span","text":". Balancing the flow of a kitchen, food and beverage service, and customer expectations is critical. Many well-established restaurants have had long and wonderful histories without the benefit of beautiful interiors. These concepts often succeed because they work so efficiently and their food and beverage program is so consistent, that the design is often overlooked by patrons. Conversely, many beautiful restaurants have not survived because they fail to operate well. We understand a restaurateur’s work has only just begun once we leave the site, and hope that what we left behind operates as efficiently as that stunningly composed symphony."}],"asset":null,"style":"normal"}],"author":{"id":"536d0949-8e43-5cc8-922f-3ec8bca935b8","image":null,"bio":null}}}}