{"data":{"allSanityPortfolio":{"edges":[{"node":{"title":"ARTUROS","description":"Whitlock Design Group designed a new bar and function room in the first phase of the renovation, taking over two small neighboring tenants. Arturo’s was an existing, successful restaurant with a loyal following in Boston’s western suburbs. The space, however, did not represent the terrific food that it served. Capitalizing on their existing customer base, Domenico Fabiano, the owner wanted to expand his bar business and possibly extend his service hours, which ended early due to the suburban location.\nThe bar is a jewel box with an impressive collection of glittering crystal sphere pendants hanging from a gold ceiling. The black and gold color palette is both a connection to classic Italian design and modern aesthetics. The island bar is designed to be narrow and allow customers to feel connected across the bar and maintain a close, community feeling. The prominent wall of the bar display adds drama to the exciting design. The cozy booths are covered in black crushed velvet and there are gold toned mirrors in pyramidal shapes along the wall. \nThe function room was an important part of the new program for Dom. He is regularly asked to celebrate occasions and have meetings in his restaurant but lacked the space for such large parties. He wanted a room that complimented the quality of his food and had character which is not found in most function venues. Large circular metal bands holding miniature LED lights add sparkle and interest to the space. A large art mural, designed by Whitlock Design Group and by mural artist, Mark Grundig, is a powerful presence on the space’s long walls. A large glass wall connects to the bar and function room and bar.\nDom asked Whitlock Design to create restrooms that were memorable and even Instagram-able. To that end, the entry to the restrooms are along a beautiful wall of long, curved, glossy, grooved black wall. At the restroom entry there is a glowing wall of shining gold geometric tiles. Inside the restrooms you are immediately greeted by an oversized image of paparazzi taking your photograph. The walls are adorned with more Whitlock/Grundig designed patterned wall murals.\n","location":"WESTBOROUGH, MASSACHUSETTS ","slug":{"_type":"slug","current":"arturos-westborough-restaurant boston interior"},"mainImage":{"asset":{"id":"544cd1ab-ef6a-5ac4-9f10-0342e00d933d","url":"https://cdn.sanity.io/images/mdtd9fbj/production/18588aeb90c1f3cf58808d5890a6fc53750a9c47-1366x886.png"}}}},{"node":{"title":"MJ O’CONNOR'S RESTAURANT ","description":"MJ O’Connor’s is a renovation of an existing bar in Boston’s Park Plaza. The space is an extension of the space that was underperforming. The new design relocates the entrance to the more prominent Park Plaza and create an exciting new prominent space. \nThe design features a new island bar that is centered between beautiful groin vaulted ceilings. Traditional materials are interpreted in modern ways creating a restrained and beautiful space with a warm palette of colors. The large island bar features a Carrera marble top and mahogany base with floating glass shelves and beer taps. New chandeliers enhance the arched ceilings and whimsical artwork on the tall wooden paneled walls gives a nod to MJ’s Irish heritage, while being universal in its appeal. \n","location":"BOSTON, MASSACHUSETTS","slug":{"_type":"slug","current":"mj-o-connor-s-restaurant-boston-massachusetts boston interior"},"mainImage":{"asset":{"id":"bf8dc538-43da-556d-949d-2cb2f8f3b651","url":"https://cdn.sanity.io/images/mdtd9fbj/production/3293f68e8c53558bdbfe304ed07f7f8107a55c0f-1366x863.png"}}}},{"node":{"title":"PAGU","description":"Pagu is a restaurant featuring a fusion of Spanish and Asian food. Tracy Chang, the chef/owner, won of Boston Magazine’s ‘Best Chef’ award shortly after introducing Pagu to the Boston restaurant scene. The innovative design features a large display kitchen with a custom Hestan cooking suite, bounded by a live edge wooden counter and bar faced with Spanish tiles. The food is the show at Pagu and a huge skillet of paella or a large suckling pig are often part of the performance. \nThe space is simply designed and is extremely flexible. Moveable wooden counters act as retail displays by day and bar tops by night and the space can be totally transformed to accommodate parties and weddings. Wood accents give warmth to the simple space with a warm and inviting bar and large curved beams to hold lighting. Accents and texture are created with Shou Sugi Ban wood, a traditional Japanese method of preserving wood by burning a thin layer of its surface.\nThe restaurant has been published in Travel + Leisure, Zagat, BonAppetit, Washington Post, Nikkei Asian, as well as the Boston Globe, Boston Magazine and Eater.\n","location":"CAMBRIDGE, MASSACHUSETTS","slug":{"_type":"slug","current":"boston-marathon"},"mainImage":{"asset":{"id":"0654fead-095e-5a11-801c-f7538476bffd","url":"https://cdn.sanity.io/images/mdtd9fbj/production/12aa58e234784f92e82d84d22e4fdc970a94a40a-5472x3648.jpg"}}}},{"node":{"title":"BEER WORKS ","description":"Whitlock Design Group designed multiple locations as well as renovated existing spaces for Boston’s original microbrewery restaurant. The concepts feature the stainless-steel brewing equipment, sometimes elevated on industrial styled mezzanines, to animate the restaurants. \nThe interior design is composed of creative metal finishes and large graphics in a simple and modern aesthetic. Large scaled lighting adds to the drama as well as fireplaces and firepits.\n","location":"HINGHAM, MASSACHUSETTS","slug":{"_type":"slug","current":"beer-works boston interior"},"mainImage":{"asset":{"id":"b6820fd5-3ed0-5034-9944-7a31b3464ce8","url":"https://cdn.sanity.io/images/mdtd9fbj/production/c5430d4dcceee81178646742c22d5b912131449c-1366x914.png"}}}},{"node":{"title":"KINGS","description":null,"location":"DORAL, FLORIDA","slug":{"_type":"slug","current":"kings-doral-florida"},"mainImage":{"asset":{"id":"3cc248ff-7b00-59fe-b2b6-9821c73b5ccb","url":"https://cdn.sanity.io/images/mdtd9fbj/production/bfd06df9164d27f5afa812a150fab98b43b46d0c-1366x911.png"}}}},{"node":{"title":"TRILLIUM BREWING COMPANY ","description":"Trillium Brewing Company is a flagship brewery, beer hall, retail space and restaurant in the historic Fort Point Channel area. Trillium has become a world-renowned microbrewery and it’s beers are featured on lists of the world’s best beers. It had long since outgrown the tiny Boston location where it began their storied brewing. The Boston Wharf warehouse boasts a fabulous wooden timber structure and brick walls that seems to tell stories of Boston’s early rise as a prominent industrial city. A palette of wood, concrete and blackened steel creates wonderful textures throughout the space. \nThe first floor is a beer hall, brewery and retail space that is designed with a large glazed wall behind its prominent bar that showcases the stainless tanks and wooden Foeder tanks. The beer making is the stage and patrons can watch the brewers as they enjoy a sip of some of the finest beers in the world. The design also allows for a queue of customers to purchase their beer, often sold in special releases that create large crowds of customers.\nThe second floor restaurant and function hall interiors highlight brick walls and wooden beam that create character and warmth to the dining spaces. A strong blackened steel and concrete stair connects the spaces with glimmering linear lights suspended from above. A window into the wood fired rotisserie and display promotes Trillium’s mission to use the freshest and finest of locally sourced ingredients. Signature lights fixtures hung in multiples and in strong geometric shapes help to bring a contemporary accent into the historic space.\nA roof deck tops the location with an exciting festive space that overlooks the historic warehouses and the rising new construction in the surrounding Seaport area. \n","location":"BOSTON, MASSACHUSETTS","slug":{"_type":"slug","current":"trillium-brewing-company-boston-massachusetts boston interior"},"mainImage":{"asset":{"id":"d03a83ca-c23f-5abc-a3d3-2036f11dc712","url":"https://cdn.sanity.io/images/mdtd9fbj/production/b61bb86c1d28863967d28bd5e44a44f1eed5e4e5-4368x2912.jpg"}}}}]},"allSanityCarousel":{"edges":[{"node":{"id":"45339ebf-edbd-5f9d-b7ca-c440379904ee","title":"Premier restaurant designer in Boston","image":{"asset":{"id":"99f66d0b-dc75-54de-855c-9899c8fa3303","url":"https://cdn.sanity.io/images/mdtd9fbj/production/91e4600e4d01bce770927ea559c520d3c6a97a86-1920x1280.jpg"}}}},{"node":{"id":"81c282ab-4a89-5f4a-9d15-1dc6fac8b36c","title":"Innovative interior design studio Boston","image":{"asset":{"id":"5b29e2b3-1168-52fb-b339-0097176eb148","url":"https://cdn.sanity.io/images/mdtd9fbj/production/1e39d7f645d9d74e37b77404611c00f7ebf9c88a-1424x951.jpg"}}}},{"node":{"id":"90dbc4c6-3376-56bd-a2e2-aace996fd1a7","title":"Restaurant interior design firm Boston ","image":{"asset":{"id":"83e555c8-06ce-5c0c-b6bc-f01b6499c6d4","url":"https://cdn.sanity.io/images/mdtd9fbj/production/a2f7645ceeee38353da4e9e9aeab35e62f956543-1920x1280.jpg"}}}},{"node":{"id":"ee74ce45-2b94-5f5d-94c2-85efcaf7958e","title":"Boston restaurant ","image":{"asset":{"id":"07ae0b6c-ffa7-5d6f-ad9a-6c172e93164f","url":"https://cdn.sanity.io/images/mdtd9fbj/production/70200fbe3a87da3d6518706eadf58f69a9b915b8-1920x1322.jpg"}}}},{"node":{"id":"6cc86330-5096-535a-80c5-80bb0d092d36","title":"Exciting and elegant bar design ","image":{"asset":{"id":"c12503ab-40f4-5572-9ec7-aec6d4284473","url":"https://cdn.sanity.io/images/mdtd9fbj/production/656b693a0f4bb3b6d425283b5038246b3b615c3e-1920x1174.jpg"}}}},{"node":{"id":"381df5a6-27b8-50a8-9efc-1e5f925b7b46","title":"Best décor restaurants Boston","image":{"asset":{"id":"ea6a127b-01f5-5492-8326-ea503b9b1ddb","url":"https://cdn.sanity.io/images/mdtd9fbj/production/ce937d0474f0c7bcca8a229bfae65f0bb4d29c6e-1920x1280.jpg"}}}},{"node":{"id":"c9bf5a02-8408-5c26-9c6c-bd243b4c2a86","title":"Best of restaurant design","image":{"asset":{"id":"b887dcca-7835-5a6c-81c1-425748f95421","url":"https://cdn.sanity.io/images/mdtd9fbj/production/d39b2e5107d43910d959f3219a5d54fa7a38a723-1920x1285.jpg"}}}}]}},"pageContext":{}}